Repository: enricocirignaco/hack4socialGood
Catalog: typo3/typo3conf/l10n/*/rtehtmlarea/Resources/Private/Language/Plugins/MicrodataSchema/*.locallang_csh.xlf
Languages: de

# currentItemType.alttitle
source: Type of current containing item
de: Typ des aktuell enthaltenen Elements

# currentItemType.description
source: This field displays the type of the item within the scope of which the current element resides, if any.
de: Dieses Feld zeigt den Typ des Elements, in dessen Rahmen das aktuelle Element liegt, falls vorhanden.

# currentItemType.details
source: If a type of item is displayed, then the current element may be assigned a property of that type of item.
de: Wenn ein Element-Typ angezeigt wird, kann dem aktuellen Element eine Eigenschaft dieser Art von Elementen zugeordnet werden.

# .description
source: The Microdata feature allows to edit microdata attributes of elements in the RTE editing area.
de: Die Microdata-Funktion erlaubt es, Microdata-Attribute von Elementen im RTE zu bearbeiten.

# .details
source: When this feature is enabled, the dialogue opened when clicking the "Edit element" button in the editor toolbar allows to edit the microdata attributes of the current element in the RTE editing area. Another button allows to make visible all microdata in the editing area. By default, this features uses the microdata dictionary defined by schema.org (http://schema.org). However, it may be configured to use other dictionaries.
de: Ist diese Funktion aktiviert, öffnet sich bei einem Klick auf die "Element bearbeiten" Schaltfläche in der Redakteurs Werkzeugleiste ein Dialog, der es dem Redakteur erlaubt die Microdata Attribute des aktuellen Elementes in dem RTE Bearbeitungsbereich zu bearbeiten. Eine weitere Schaltfläche ermöglicht es alle Microdata Attribute in dem Bearbeitungsbereich sichtbar werden zu lassen. In der Standardeinstellung nutzen diese Funktionen das Microdata Nachschlagewerk von schema.org (http://schema.org). Wie auch immer, es können auch andere Nachschlagewerke konfiguriert werden.

# .image_descr
source: "Edit element" icon. When the cursor is inside an element, clicking it opens a dialogue that allows to edit the microdata attributes of the element. "Show microdata" icon. Clicking it shows or hides all microdata items in the editing area.
de: "Element bearbeiten"-Symbol. Wenn sich der Mauszeiger über einem Element befindet, öffnet ein Klick einen Dialog in dem die Microdata-Attribute für dieses Element bearbeitet werden können. "Microdata anzeigen"-Symbol. Ein Klick öffnet oder verbirgt alle Microdata-Elemente im Bearbeitungsbereich.

# itemprop.alttitle
source: Item property
de: Elementeigenschaft

# itemprop.description
source: Select the item property associated to the current element.
de: Die mit dem aktuellen Element zu verbindende Elementeigenschaft auswählen.

# itemprop.details
source: The properties displayed in this selector box are those of the type of the current containing item.
de: Die in diesem Auswahlfeld angezeigten Eigenschaften entsprechen dem Typ des aktuell enthaltenen Elements.

# itemscope.alttitle
source: Item scope
de: Element Umfang

# itemscope.description
source: Check/uncheck this checkbox in order to set or unset this element as an item.
de: Diese Checkbox aktivieren/deaktivieren, um dieses Element als ein Element zu aktivieren oder zu deaktivieren.

# itemscope.details
source: If the checkbox is checked, then the current element is identified as an item and should be assigned a type.
de: Wenn diese Checkbox aktiviert ist, wird das aktuelle Element als ein Element identifiziert und sollte einem Typ zugewiesen werden.

# itemtype.alttitle
source: Item type
de: Elementtyp

# itemtype.description
source: Select the type of item to be assigned to the current element.
de: Wählen Sie den Elementtyp, den Sie der aktuellen Auswahl zuweisen wollen.

# Show_microdata.alttitle
source: Show microdata
de: Microdata zeigen

# Show_microdata.description
source: Show/hide all microdata items in the editing area..
de: Anzeigen/verbergen aller Microdata-Elemente im Bearbeitungsbereich..

# Show_microdata.details
source: Clicking the "Show microdata" button makes all microdata items in the editing area visible or, if they are currently visible, the button being highlighted as active, hides these items. The type or the property of each item is shown in small capital letters in front of the element providing the microdata value. This applies only when editing content and has no effect when the element is rendered in the frontend.
de: Anklicken der Schaltfläche "Microdata anzeigen" macht alle Microdata-Elemente zur Bearbeitung sichtbar oder, wenn sie aktuell sichtbar sind und die Schaltfläche als aktiv markiert ist, unsichtbar. Der Typ oder die Eigenschaft jedes Elements wird in Kleinbuchstaben vor dem Element angezeigt, das den Microdata-Wert bereitstellt. Das gilt nur während des Bearbeitens von Inhalten und hat keine Auswirkungen auf die Ausgabe im Frontend.

# Show_microdata.image_descr
source: "Show microdata" icon.
de: Symbol "Microdata anzeigen".
