Repository: enricocirignaco/hack4socialGood
Catalog: typo3/typo3conf/ext/powermail/Resources/Private/Language/*.locallang_csh_tx_powermail_domain_model_fields.xlf
Languages: de

# title.description
source: Enter a label for your Field
de: Geben Sie eine Feldbezeichnung ein

# type.description
source: Choose the type of your Field
de: Wählen Sie den Feldtyp aus

# settings.description
source: One option per line. If you want to split value and label, use a | symbol. Preselect with *
de: Pro Option eine neue Zeile. Wenn Bezeichnung und Wert getrennt werden sollen, kann das Zeichen | verwendet werden. Vorauswahl mit *

# path.description
source: Add a path to the TypoScript that should be rendered (e.g. lib.showsometext)
de: TypoScript Pfad eintragen, der gerendert werden soll (z.B. lib.zeigeeinentext)

# content_element.description
source: Choose a content element that should be renderen within your form
de: Wählen Sie einen beliebigen Seiteninhalt aus, der im Formular angezeigt werden soll

# text.description
source: Save a text for a frontend output
de: Geben Sie einen Text ein, der im Formular angezeigt werden soll

# sender_email.description
source: Will this field contain the Email of the user?
de: Wird dieses Feld die E-Mail des Benutzers beinhalten?

# sender_name.description
source: Will this field contain the Name or a part of the Name of the user?
de: Wird dieses Feld den Namen oder einen Teil des Namens des Benutzers beinhalten?

# validation_title.description
source: Validation Settings
de: Validierungseinstellungen

# mandatory.description
source: Should this field be a mandatory field?
de: Muss der Benutzer dieses Feld ausfüllen?

# validation.description
source: Validate the field value (url, email, etc...)
de: Überprüfung ob dieses Feld (z.B.) eine E-Mail beinhaltet

# validation_configuration.description
source: This value influences the validation (if you choose range, you can use e.g. 1,10 to have a range field from 1 to 10) (if you choose pattern validation, you can use regular expressions e.g. like https?://.+ to validate for a beginning https-link)
de: Dieser Wert beeinflusst die vorgenommene Validierung (Wenn Sie eine Validierung vom Typ Zahl mit Minimum und Maximum gewählt haben dann bedeutet 1,10 eine Auswahl von 1 bis 10) (Wenn Sie beispielsweise eine Validierung mit Pattern ausgewählt haben und https?://.+ eintragen, wird auf einen beginnenden https-link hin überprüft)

# prefill_title.description
source: Prefill Settings
de: Vorfüll-Einstellungen

# prefill_value.description
source: Prefill this field with a static text. The related field wil be prefilled (If you use a prefill value for a country-field, add the wanted code - e.g. DEU or USA)
de: Füllen Sie dieses Feld mit einem statischen Text vor (Wenn Sie ein Feld vom Typ Länderauswahl nutzen, können Sie mit dem entsprechenden Code diese Auswahl vordefinieren - z.B. DEU oder USA)

# placeholder.description
source: A placeholder text is an example, that should help the user to fill out an input field. This text is shown in bright grey within the input field. If you have a name field, you could use the placeholder "John Doe"
de: Ein Platzhalter ist ein Text, der dem Besucher die Eingabe erleichtert soll. Der Text erscheint hellgrau im Feld. Bei einem Feld, dass den Namen abfragen soll, könnte man z.B. "Rainer Zufall" eintragen

# feuser_value.description
source: Prefill this field with value of a logged in fe_user (overwrites the static prefill text)
de: Füllen Sie dieses Feld mit einem Wert aus der Frontend-Benutzer-Tabelle (dies überschreibt den statischen Text)

# create_from_typoscript.description
source: Options can be dynamicly generated by TypoScript (e.g. lib.options=TEXT lib.options.value=red[\n]blue[\n]pink). Add the path to the TypoScript object.
de: Optionen können dynamisch über TypoScript erstellt und verwendet werden (z.B. lib.options=TEXT lib.options.value=red[\n]blue[\n]pink). Einfach Pfad zum TypoScript Objekt einfügen.

# css.description
source: Choose a Layout (This may change the Frontend Rendering - please ask your administrator for more information)
de: Wählen Sie ein Layout (Diese Änderung kann sich auf das Aussehen im Frontend auswirken - bitte fragen Sie Ihren Administrator für weitere Informationen)

# multiselect.description
source: If you want to have a select field, where your users can select more than only one entry, activate this settings
de: Wenn Sie ein Auswahlfeld benötigen, bei dem der Besucher mehr als nur eine Auswahl treffen kann, können Sie diese Einstellung wählen

# datepicker_settings.description
source: Choose the type of the datepicker (date only or date and time or time only)
de: Typ des Datepickers auswählen (nur Datum oder Datum und Uhrzeit oder nur Uhrzeit)

# marker_title.description
source: Variables Settings
de: Variablen-Einstellungen

# auto_marker.description
source: This variable was automaticly generated by the system
de: Diese Variable wurde automatisch vom System erstellt

# marker.description
source: Use your own variable in a Rich Text Editor (e.g.)
de: Benutzen Sie Ihre eigene Variable in einem RTE

# own_marker_select.description
source: Check this if you want to change the automaticly generated variable
de: Nutzen Sie diese Einstellung, wenn Sie die automatisch erstellte Variable überschreiben wollen

# pages.description
source: Add the related page to this field
de: Verknüpfte Seite zu diesem Feld auswählen
