Repository: enricocirignaco/hack4socialGood
Catalog: typo3/typo3conf/l10n/*/lang/4.5/*.locallang_csh_pages.xlf
Languages: de

# .description
source: A 'Page' record usually represents a webpage in TYPO3. All pages have an ID number (UID) by which they can be linked and referenced. The 'Page' record itself does not contain the content of the page. 'Page Content' records (Content Elements) are used for this.
de: Der Datensatz "Seite" repräsentiert üblicherweise eine Webseite in TYPO3. Alle Seiten haben eine ID (UID) über die sie verlinkt und referenziert werden können. Der Datensatz "Seite" selbst enthält jedoch nicht die Inhalte der Seite. Hierfür werden Datensätze vom Typ "Inhaltselement" verwendet.

# .details
source: The pages' table is the backbone of TYPO3. All records editable by the main modules in TYPO3 must belong to a page. It's exactly like files and folders on your computer's hard drive. <b>The Pagetree</b> The pages are organized in a tree structure that reflects the organization of your website. <b>UID, PID and the Pagetree Root</b> All database elements have a field 'uid' which is a unique identification number. They also have a field 'pid' (page id) which holds the ID number of the page to which they belong. If the 'pid' field is zero, the record is found in the 'root.' Only administrators are allowed access to the root. Table records must be configured to either belong to a page or be found in the root. <b>Storage of Database Records</b> Depending on the 'Type,' a page may also represent general storage for database elements in TYPO3. In this case, it is not available as a webpage but is used internally in the Pagetree as a place to store items such as users, subscriptions, etc. Such pages are typically of the type "Folder".
de: Die Tabelle 'pages' ist das Rückgrat von TYPO3. Alle Datensätze, die im Hauptmodul von TYPO3 bearbeitet werden können, müssen zu einer Seite gehören. Es ist genau wie bei Dateien und Ordnern auf der Festplatte Ihres Computers. <b>Der Seitenbaum</b> Die Seiten werden in einer Baumstruktur angeordnet, die die Organisation Ihrer Website wiederspiegelt. <p>UID, PID und die Seitenbaum-Wurzel</b> Alle Datenbankelemente haben ein Feld 'uid', die eine eindeutige Identifikationsnummer ist. Sie haben auch ein Feld "pid" (Seiten-ID), welche die ID der Seite enthält (= deren uid), zu der sie gehören. Wenn das "pid"-Feld Null ist, wird der Datensatz in der Wurzel-Seite angezeigt. Nur Administratoren ist der Zugriff auf die Wurzel-Seite erlaubt. Datensätze müssen so konfiguriert werden, dass sie entweder zu einer Seite gehören oder in der Wurzel gezeigt werden. <b>Speicherung der Datenbank-Datensätze</b> Je nach "Typ" kann eine Seite auch ein allgemeiner Speicher für Datenbankelemente in TYPO3 sein. In diesem Fall ist sie nicht als eine Webseite verfügbar, sondern sie wird intern im Seitenbaum als ein Ort benutzt, um Elemente zu speichern wie z. B. Benutzer, Anmeldungen, usw. Solche Seiten sind in der Regel vom Typ "Ordner".

# doktype.description
source: Page Type determines whether the page is normal webpage, a shortcut to another webpage, or used in other internal ways.
de: Der Seitentyp bestimmt, ob es sich bei der Seite um eine normale Webseite oder einen Verweis auf eine andere Seite handelt oder ob sie anderweitig intern genutzt wird.

# doktype.details
source: 'Standard' is the most common Page Type and is used for normal webpages. 'Folder' is a page type which is not shown as a webpage; instead, it stores records of your choice. 'Recycler' is a garbage can. Pages and records in a recycler are not visible in the frontend. <b>Notice</b> Each page type is represented by a unique icon. The available page types can be restricted for users so all of the options described above may not be visible. Finally, some records may only be allowed on certain page types, but any record can be placed in a 'Folder.' <b>$PAGES_TYPES [Technical]</b> The restrictions that apply to each Page Type is defined in the global array $PAGES_TYPES. When extensions add tables to TYPO3 they may need to register their tables in $PAGES_TYPES so they can be created on standard pages.
de: 'Standard' ist der häufigste Seitentyp und wird für normale Webseiten verwendet. 'Ordner' ist ein Seitentyp, der nicht als Webseite dargestellt wird; stattdessen werden dort Datensätze Ihrer Wahl gespeichert. 'Papierkorb' ist ein Mülleimer. Seiten und Datensätze in einem Papierkorb sind im Frontend nicht sichtbar. <b>Hinweis</b> Jeder Seitentyp wird durch ein eindeutiges Symbol gekennzeichnet. Die verfügbaren Seitentypen können je nach Benutzer eingeschränkt werden, so dass nicht alle oben beschriebenen Optionen sichtbar sind. Einige Datensätze können nur auf bestimmten Seitentypen gespeichert werden, aber jeder Datensatz kann in einem 'Ordner' gespeichert werden. <b>$PAGES_TYPES [Technisch]</b> Die Einschränkungen zu jedem Seitentyp sind im globalen Array $PAGES_TYPES definiert. Wenn Erweiterungen Tabellen zu TYPO3 hinzufügen, dann ist es eventuell notwendig, diese Tabellen in $PAGES_TYPES zu registrieren, so dass sie auf Seiten vom Typ "Standard" hinzugefügt werden können.

# doktype.image_descr
source: This snippet of the page tree shows regular pages (white icons) at the top of this screenshot. You also see a Recycler page. Any records stored in a Reycler page are considered trash and not shown on the website. The gray folders icons represent "Folders". They cannot be viewed as regular webpages but serve as storage pages for other database records.
de: Dieser Ausschnitt des Seitenbaums zeigt einige normale Seiten (schwach gelbe Symbole, im oberen Teil). Der Papierkorb ("Garbage") mit seinem besonderen Symbol ist ebenfalls sichtbar. Die Seiten im Papierkorb werden auf der Website nicht angezeigt und sind Kandidaten für eine endgültige Löschung. Im unteren Teil sehen Sie (graue) "SysOrdner". Diese werden ebenfalls niemals als Webseiten angezeigt, sondern ermöglichen die Speicherung beliebiger Daten.

# _doktype.seeAlso
source: be_groups:pagetypes_select, About $PAGES_TYPES | https://docs.typo3.org/typo3cms/CoreApiReference/PageTypes/
de: be_groups:pagetypes_select, Über $PAGES_TYPES | https://docs.typo3.org/typo3cms/CoreApiReference/PageTypes/

# editlock.description
source: If set, non-admin users cannot edit the page properties or any records on the page, but may still edit subpages. They cannot create new records or pages on the page either.
de: Wenn gesetzt können Nicht-Administratoren die Seiteneigenschaften oder irgendeinen Datensatz auf der Seite nicht bearbeiten. Unterseiten können weiterhin bearbeitet werden. Neue Datensätze und Seiten auf dieser Seite können nicht erstellt werden.

# fe_login_mode.description
source: The Login Behavior allows the logins and other related featured to be disabled for this page.
de: Das Anmeldungsverhalten erlaubt es, die Anmeldungen und andere ähnliche Funktionen für diese Seite zu deaktivieren.

# fe_login_mode.details
source: When a user logs into TYPO3's frontend, each page and/or its Content Elements can be set to restrict access based on the user's login. By disabling logins, restrictions are removed and the content is accessible whether or not a user is logged in and regardless of Frontend usergroup settings. When logins are disabled for a page, cache headers can be sent again.
de: Wenn sich ein Benutzer am TYPO3-Frontend anmeldet, kann jede Seite und/oder ihre Inhaltselemente so konfiguriert werden, dass der Benutzer basierend auf seiner Anmeldung auf sie zugreifen oder nicht auf sie zugreifen kann. Werden Anmeldungen deaktiviert, so werden auch die genannten Beschränkungen entfernt und auf den Inhalt kann zugegriffen werden, unabhängig davon, ob ein Benutzer angemeldet ist und unabhängig von Einstellungen der Frontend-Benutzergruppen. Wenn Anmeldungen für eine Seite deaktiviert sind, könnn Cache-Header noch einmal gesendet werden.

# .image_descr
source: The most basic fields on a page are the Disable Page option, the Type of page ("doktype") and the Page Title. Pages are arranged in a Pagetree in TYPO3. The page from the editing form in the previous screenshot was the "Intro" page from this Pagetree. As you can see it belongs in the root of the Pagetree and has a number of subpages pages under it.
de: Die wichtigsten Felder einer Seite sind die Markierung "verborgen" ("hidden"), der Typ der Seite ("doktype") und der Seitentitel. Seiten sind in TYPO3 in einem Seitenbaum organisiert. Das Bearbeitungsformular im vorherigen Screenshot bezieht sich auf die Seite "Intro" des Seitenbaums. Wie Sie sehen können ist sie der Wurzel des Baums zugeordnet und besitzt eine Reihe von Unterseiten.

# php_tree_stop.description
source: Stops backend rendering of the page tree in navigation and lists.
de: Stoppt die Darstellung des Seitenbaums in der Navigation und in Listen.

# php_tree_stop.details
source: If you enable this option, the Pagetree will not expand that branch. Instead you will see a red "+" which indicates that the Pagetree stops here because the Stop Page Tree option is enabled. This option was designed to prevent the display of a branch with an unmanageable number of subpages. By clicking on the red "+" the page will become a temporary mount point in the navigation frame, thus facilitating easier navigation and editing.
de: Wenn Sie diese Option aktivieren, wird der Seitenbaum diesen Zweig nicht ausklappen. Stattdessen sehen Sie ein rotes "+", das anzeigt, dass die Darstellung des Seitenbaums hier stoppt, weil die entsprechende Option aktiviert ist. Diese Option wurde konzipiert, um die Anzeige eines Zweigs mit einer zu großen Anzahl an Unterseiten zu verhindern. Nach einem Klick auf das rote "+" wird die Seite im Navigationsrahmen als temporärer Freigabepunkt dargestellt, so dass Navigation und Bearbeitung erleichtert werden.

# php_tree_stop.image_descr
source: Here the "Stop page tree" option is enabled. In the Pagetree, this setting is reflected with the red "+" and the Expand/Collapse Pagetree icon will be disabled for that branch of the tree. If you click the red "+" the page will be mounted temporarily in the navigation frame.
de: Hier ist der Schalter "Seitenbaum stoppen" gesetzt. Im Seitenbaum ist der gesetzte Schalter sichtbar durch das rote "+" und der Ast des Baums kann nicht mehr aufgeklappt werden. Nach Anklicken des roten "+" wird der Ast als "Temporärer Einstiegspunkt" an Stelle des Seitenbaums dargestellt.

# _.seeAlso
source: xMOD_csh_corebe:pagetree, tt_content, About pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageTree/
de: xMOD_csh_corebe:pagetree, tt_content, Über Seiten | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageTree/

# storage_pid.description
source: A General Record Storage Page is a global page for storing of general database elements (records) of a website. This could be for templates, frontend users, and other records that are not limited to a single page but shared across the whole website.
de: Eine allgemeine Speicherseite für Datensätze ist eine globale Seite zum Speichern allgemeiner Datenbankelemente (Datensätze) einer Website. Sie kann benutzt werden für TypoScript-Templates, Frontend-Benutzer und andere Datensätze, die sich nicht bloß auf eine einzelne Seite, sondern auf die gesamte Website beziehen.

# storage_pid.details
source: It is recommended that extensions support the "General Record Storage Pages" so that the extension accesses records in this location by default when not configured to look elsewhere. A General Record Storage Page is typically a page of the "Folder" type.
de: Es wird empfohlen, dass Erweiterungen allgemeine Speicherseiten für Datensätze unterstützen, so dass die Erweiterung standardmäßig an diesem Ort auf Datensätze zugreift, es sei denn, sie ist konfiguriert, woanders zu suchen. Eine allgemeine Speicherseite für Datensätze ist typischerweise eine Seite des Typs "Ordner".

# _storage_pid.seeAlso
source: The Storage Folder | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/SpecialPages/Index.html#folders
de: Der Speicherordner | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/SpecialPages/Index.html#folders

# title.description
source: Enter the title of the page or folder. This field is required.
de: Geben Sie den Titel der Seite ein! Dieses Feld ist ein Pflichtfeld.

# title.details
source: The Page Title is used to represent the page visually in the system, for example in the Pagetree. Also the Page Title is used by default for navigation links on webpages. You can always change the Page Title without affecting links to a page. This is because pages are always referenced by ID number, not their title. You can use any characters in the Page Title.
de: Der Seitentitel repräsentiert die Seite im System, z.B. im Seitenbaum. Standardmäßig wird der Seitentitel gleichzeitig als Linktitel innerhalb der Webseite verwendet. Sie können den Seitentitel jederzeit ändern, ohne damit Links auf die Seite zu verändern; das System referenziert Seiten nämlich über ihre "uid" und nicht über den Seitentitel. In diesem Feld sind beliebige Zeichen erlaubt.

# title.image_descr
source: The field for the Page Title has a small "Required" icon next to it; You must supply a Page Title. You cannot save the new page unless you enter a title for it.
de: Das Feld für den Titel der Seite ist mit einem kleinen "Pflichtfeld"-Symbol markiert: Sie <b>müssen</b> einen Seitentitel eingeben, sonst können Sie die Seite nicht speichern!

# TSconfig.description
source: Page TSConfig.
de: Seiten-TSconfig.

# TSconfig.details
source: 'TypoScript' is a concept for entering values in a hierarchical structure that is used to create templates for TYPO3 websites. The same principles of storing a hierarchy of values is also used to configure various Backend functionality such as Modules and the RTE. The 'TSConfig' for an individual page is actually an accumulation of all 'TSConfig' values beginning from the root page and trickling downward to the current page. This means the TSConfig on the current page will affect all of its subpages as well. All TSconfig in use on a page is available from the 'Page TSconfig' menu in the 'Web>Info' Module (requires the "info_pagetsconfig" extension to be installed).
de: 'TypoScript' ist ein Konzept zur Konfiguration von Werten in einer Baumstruktur, das für die Erstellung von Templates für TYPO3-Websites verwendet wird. Das gleiche Prinzip der Eingabe von Werten in einer Baumhierarchie wird ebenfalls verwendet, um verschiedene Eigenschaften in Bezug auf das Backend, Funktionen in Modulen, dem "Rich Text Editor" usw. einzustellen. Das endgültige "TSconfig" für eine Seite ist die Summe aller "TSconfig"-Werte von der Wurzel des Seitenbaums bis zur aktuellen Seite. So werden alle Kindseiten der aktuellen Seite ebenfalls beeinflusst; sie erben die Konfiguration ihrer Vaterseite. Eine Darstellung des wirksamen Seiten-"TSconfig" können Sie über das Menü "Seiten-TSconfig" im Modul "Web > Info" einsehen (wenn die Erweiterung "info_pagetsconfig" installiert ist).

# TSconfig.image_descr
source: Page TSConfig customizing layout labels in the Page Module. Note that the Page TSconfig is specific to that page and will be inherited by its subpages.
de: Seiten-TSconfig, das Layout-Beschriftungen im Seitenmodul anpasst. Beachten Sie, dass Seiten-TSconfig für de jeweilige Seite gilt und an Unterseiten vererbt wird.

# _TSconfig.seeAlso
source: _MOD_web_info:tsconfig_hierarchy, More about Page TSconfig | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/
de: _MOD_web_info:tsconfig_hierarchy, Mehr über Seiten-TSconfig | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/

# TSconfig.syntax
source: Basic TypoScript Syntax <em>without</em> 'Constants.' It is recommended that only admin users have access to this field!
de: Grundlegender TypoScipt-Syntax <em>ohne</em> Konstanten. Es wird empfohlen, dass nur Admin-Benutzer Zugang zu diesem Bereich haben!
